Revit 2027 API
BuiltInFailures.FamilyFailures.ColumnTooLong Property
 This column is too long. Maximum length is 30,000 ft.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnTooLong { get; }
Public Shared ReadOnly Property ColumnTooLong As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnTooLong {
	FailureDefinitionId^ get ();
}
static member ColumnTooLong : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace